In [2]:
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
%matplotlib inline

from pydataset import data

In [3]:
shopping_cart = {
    "tax": .08,
    "items": [
        {
            "title": "orange juice",
            "price": 3.99,
            "quantity": 1
        },
        {
            "title": "rice",
            "price": 1.99,
            "quantity": 3
        },
        {
            "title": "beans",
            "price": 0.99,
            "quantity": 3
        },
        {
            "title": "chili sauce",
            "price": 2.99,
            "quantity": 1
        },
        {
            "title": "chocolate",
            "price": 0.75,
            "quantity": 9
        }
    ]
}

In [4]:
df = pd.DataFrame(shopping_cart)
df

    tax                                                    items
0  0.08  {'title': 'orange juice', 'price': 3.99, 'quantity': 1}
1  0.08          {'title': 'rice', 'price': 1.99, 'quantity': 3}
2  0.08         {'title': 'beans', 'price': 0.99, 'quantity': 3}
3  0.08   {'title': 'chili sauce', 'price': 2.99, 'quantity': 1}
4  0.08     {'title': 'chocolate', 'price': 0.75, 'quantity': 9}

In [7]:
# unpack the values of the items column by applying the pd.Series() method to the items column. 
# This returns a new DataFrame.
items = df['items'].apply(pd.Series)
items

          title  price  quantity
0  orange juice   3.99         1
1          rice   1.99         3
2         beans   0.99         3
3   chili sauce   2.99         1
4     chocolate   0.75         9

In [9]:
# unpacked tax by applying the pd.Series() method
tax = df['tax'].apply(pd.Series)
tax

      0
0  0.08
1  0.08
2  0.08
3  0.08
4  0.08

In [16]:
# concated items and tax on an inner join
big_df = pd.concat([items, tax], axis=1, join='inner')

          title  price  quantity     0
0  orange juice   3.99         1  0.08
1          rice   1.99         3  0.08
2         beans   0.99         3  0.08
3   chili sauce   2.99         1  0.08
4     chocolate   0.75         9  0.08

In [17]:
# `items` IS already a list of dictionaries, so if I don't need tax, I can do this.
items = shopping_cart['items']
items

[{'title': 'orange juice', 'price': 3.99, 'quantity': 1},
 {'title': 'rice', 'price': 1.99, 'quantity': 3},
 {'title': 'beans', 'price': 0.99, 'quantity': 3},
 {'title': 'chili sauce', 'price': 2.99, 'quantity': 1},
 {'title': 'chocolate', 'price': 0.75, 'quantity': 9}]

In [18]:
# I can pass my list of dictionaries as the data argument to `pd.DataFrame`.
cart_items = pd.DataFrame(items)
cart_items

          title  price  quantity
0  orange juice   3.99         1
1          rice   1.99         3
2         beans   0.99         3
3   chili sauce   2.99         1
4     chocolate   0.75         9

In [19]:
type(cart_items)

pandas.core.frame.DataFrame

In [20]:
# Here is my default `RangeIndex` object.

cart_items.index

RangeIndex(start=0, stop=5, step=1)

In [21]:
# My column labels are also an index object.

cart_items.columns

Index(['title', 'price', 'quantity'], dtype='object')

In [22]:
fam = {'name':['Milla', 'Steve', 'Faith', 'Declan'], 
       'signs':['Virgo', 'Gemini', 'Aquarius', 'Aries'],
       'age': [14, 44, 34, 7]} 
fam

{'name': ['Milla', 'Steve', 'Faith', 'Declan'],
 'signs': ['Virgo', 'Gemini', 'Aquarius', 'Aries'],
 'age': [14, 44, 34, 7]}

In [23]:
type(fam)

dict

In [27]:
fam_df = pd.DataFrame(fam, index = ['kane_1','kane_2','kane_3','kane_4'])
fam_df

          name     signs  age
kane_1   Milla     Virgo   14
kane_2   Steve    Gemini   44
kane_3   Faith  Aquarius   34
kane_4  Declan     Aries    7

In [28]:
fam_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, kane_1 to kane_4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   signs   4 non-null      object
 2   age     4 non-null      int64
dtypes: int64(1), object(2)
memory usage: 128.0+ bytes

In [33]:
#I can use the pandas pd.read_sql() method to read the results of a SQL query into a pandas DataFrame.
# df = pd.read_sql(sql_query, connection_url)
# To do this, I will need to import host, password, and user from my env file.
from env import host, password, user
def get_connection(db, user=user, host=host, password=password):
    return f'mysql+pymysql://{user}:{password}@{host}/{db}'

In [32]:
sql_query = 'SELECT * FROM employees'
sql_query

'SELECT * FROM employees'

In [35]:
def get_employees_data():
    return pd.read_sql(sql_query, get_connection('employees'))
get_employees_data

In [59]:
# I only need to run this code once to create a new CSV file in my current directory, and then I can read in my
# data as shown in the next section. I can comment out the code I was using to read in my data and write to a 
# CSV file after I have my CSV file.
df.to_csv('new_file_name.csv')
# example employees.to_csv('employees_df.csv')
#employees = pd.read_csv('employees_df.csv', index_col=0)

In [40]:
from pydataset import data

In [42]:
#This code snippet will show me the information doc on the dataset.
data(df_string_name, show_doc=True)

NameError: name 'df_string_name' is not defined

In [45]:
#This code snippet will load the dataset for use as a pandas DataFrame.
df = data(df_string_name)

NameError: name 'df_string_name' is not defined

In [44]:
data()

        dataset_id                                             title
0    AirPassengers       Monthly Airline Passenger Numbers 1949-1960
1          BJsales                 Sales Data with Leading Indicator
2              BOD                         Biochemical Oxygen Demand
3     Formaldehyde                     Determination of Formaldehyde
4     HairEyeColor         Hair and Eye Color of Statistics Students
..             ...                                               ...
752        VerbAgg                  Verbal Aggression item responses
753           cake                 Breakage Angle of Chocolate Cakes
754           cbpp                 Contagious bovine pleuropneumonia
755    grouseticks  Data on red grouse ticks from Elston et al. 2001
756     sleepstudy       Reaction times in a sleep deprivation study

[757 rows x 2 columns]

In [46]:
colors = data('HairEyeColor')
colors.head()

    Hair    Eye   Sex  Freq
1  Black  Brown  Male    32
2  Brown  Brown  Male    53
3    Red  Brown  Male    10
4  Blond  Brown  Male     3
5  Black   Blue  Male    11

In [47]:
pd.read_clipboard()

Empty DataFrame
Columns: [pd.read_clipboard()]
Index: []

In [48]:
pd.read_clipboard(headers=None, names=desired_column_names)

NameError: name 'desired_column_names' is not defined

In [49]:
# There are 433 methods and attributes of a pandas Series.

series_attribute_methods = set(dir(pd.Series))
len(series_attribute_methods)

434

In [50]:
# There are 430 methods and attributes of a pandas DataFrame.

df_attribute_methods = set(dir(pd.DataFrame))
len(df_attribute_methods)

431

In [52]:
# There are 378 methods and attributes that belong to both pandas Series AND DataFrames.

len(series_attribute_methods & df_attribute_methods)

378

In [53]:
# Peek at student_df

student_df.head(1)

NameError: name 'student_df' is not defined

In [54]:
new = [{'name': 'Penny', 'signs': 'Libra', 'age': '0'},
       {'name': 'Betty', 'signs': 'Libra', 'age': '1'},
       {'name': 'Pris', 'signs': 'Scorpio', 'age': '2'}]

In [55]:
new_df = pd.DataFrame(new, index=['kane_5', 'kane_6', 'kane_7'])
new_df

         name    signs age
kane_5  Penny    Libra   0
kane_6  Betty    Libra   1
kane_7   Pris  Scorpio   2

In [56]:
# Concatenate my new_df to my original fam_df; the default is axis=0 to stack these dfs.
fam_df = pd.concat([fam_df, new_df])
fam_df

          name     signs age
kane_1   Milla     Virgo  14
kane_2   Steve    Gemini  44
kane_3   Faith  Aquarius  34
kane_4  Declan     Aries   7
kane_5   Penny     Libra   0
kane_6   Betty     Libra   1
kane_7    Pris   Scorpio   2

In [57]:
new_col_df = pd.DataFrame({'eyes': ['brown','brown','blue','brown','amber','brown','hazel'],
                          'hair': ['brown','black','blonde','red','red','black','red']},
                         index = ['kane_1', 'kane_2', 'kane_3','kane_4','kane_5','kane_6', 'kane_7'])

new_col_df

         eyes    hair
kane_1  brown   brown
kane_2  brown   black
kane_3   blue  blonde
kane_4  brown     red
kane_5  amber     red
kane_6  brown   black
kane_7  hazel     red

In [58]:
fam_df = pd.concat([fam_df,new_col_df], axis=1, sort=False)
fam_df

          name     signs age   eyes    hair
kane_1   Milla     Virgo  14  brown   brown
kane_2   Steve    Gemini  44  brown   black
kane_3   Faith  Aquarius  34   blue  blonde
kane_4  Declan     Aries   7  brown     red
kane_5   Penny     Libra   0  amber     red
kane_6   Betty     Libra   1  brown   black
kane_7    Pris   Scorpio   2  hazel     red